# Guido van Rossum <guido@python.org>

def step1():
    """Вступление"""
    print(
        'Утка-маляр 🦆 решила выпить зайти в бар. '
        'Взять ей зонтик? ☂️'
    )
    legend(step2_umbrella, step2_no_umbrella)


def legend(function1, function2):
    """Вызывает необходимую функцию в зависимости от ответа пользователя"""
    option = ''
    options = {'да': True, 'нет': False}
    while option not in options:
        print('Выберите: {}/{}'.format(*options))
        option = input()
    if options[option]:
        function1()
    else:
        function2()


def step2_umbrella():
    """Ветка истории, при выборе пользователем ответа Да"""
    print(
        'Невнимательный маляр совсем забыл, что в его семье '
        'зонтик имеется только у жены, и был пойман с поличным.\n'
        'Однако, наш герой выкрутился и сказал, что идет за продуктами.\n'
        'Необходимо помочь рассчитать общую стоимость продуктов. Поможете?'
    )
    legend(cost_of_products, sad_story)


def step2_no_umbrella():
    """Ветка истории, при выборе пользователем ответа Нет"""
    print(
        'Прежде, чем идти в бар, нужно понимать, сколько можно выпить!\n'
        'Необходимо рассчитать количество пива, '
        'которое можно выпить утке, зная ее вес. Поможете?'
    )
    legend(amount_of_beer, sad_story_2)


def cost_of_products():
    """Расчет стоимости покупки, исходя из числа каждого товара"""
    products = {'milk': 60, 'bread': 55, 'cookies': 120}
    print(
        'Сколько будем брать молока, хлеба и печенек?\n'
        'Введите 3 целых числа через пробел'
    )
    milk, bread, cookies = map(int, input().split())
    desired_value = (products['milk'] * milk +
                     products['bread'] * bread +
                     products['cookies'] * cookies)
    print('Нашей утке нужно потратить {} родных рублей'.format(desired_value))


def amount_of_beer():
    """Расчет порогового числа кружек пива для утки при данном весе"""
    print('Введите вес утки в кг')
    weight_of_duck = int(input())
    desired_amount = int((weight_of_duck / 4) / 0.5) + 1
    print('Нашей утке можно выпить {} пива'.format(desired_amount))


def sad_story():
    """Текст при отказе пользователя помогать утке"""
    print(
        'По радио передали о бытовой ссоре на почве '
        'невнимательного использования семейных сбережений.\n'
        'В госпиталь поступила утка-маляр с тяжелыми телесными повреждениями'
    )


def sad_story_2():
    """Текст при отказе пользователя помогать утке - 2"""
    print(
        'По радио передали о нападениях вусмерть пьяной утки на прохожих.\n'
        'Потребовалось семь полицейских патрулей, чтобы усмирить преступника'
    )


if __name__ == '__main__':
    step1()
